<!-- dflook/terraform-github-actions {"workspace":"binary-plan","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"509569e4e705ab28100f8b23e0db47f03492ab17039acfe9329237c81825eccb","plan_job_ref":"Job Test plan target and replace #395 at https://github.com/dflook/terraform-github-actions/actions/runs/7440040487","plan_hash":"c8523aa32b7f23f5bcb63d3202c23a686042ce5baf0dac755605e4105c307376","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __binary-plan__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "2vmtUNG1jv" -> (known after apply)
!~  foreach = "wkKsLCVxlh" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #395](https://github.com/dflook/terraform-github-actions/actions/runs/7440040487)